In [52]:
import pandas as pd

from sqlalchemy import create_engine,text

In [73]:
server_name = ' mention server name'
database_name = 'mention database name'
username = 'mention user name'
password = 'type password'
driver = 'ODBC Driver 17 for SQL Server'

#connection_string = f'mssql+pyodbc://{username}:{password}@{server_name}/{database_name}?driver={driver}'
connection_string = f'mssql+pyodbc://{username}:{password}@{server_name}/{database_name}?driver=ODBC+Driver+17+for+SQL+Server'

engine = create_engine(connection_string)

connection = engine.connect()

In [74]:
res = connection.execute(text("select * from geo_USA"))
for row in res:
    print(row)

('G2', 'USA', 'Americas')

In [75]:
"""
with engine.connect() as conn:
    res = conn.execute(text("select * from people where Team = 'Delish'"))
    for row in res:
        print(row)
"""

'\nwith engine.connect() as conn:\n    res = conn.execute(text("select * from people where Team = \'Delish\'"))\n    for row in res:\n        print(row)\n'

In [76]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [77]:
%sql $connection_string
#%sql mssql+pyodbc://{username}:{password}@{server_name}/{database_name}?driver=ODBC+Driver+17+for+SQL+Server

In [78]:
%%sql

select * from geo

 * mssql+pyodbc://veerareddy:***@DESKTOP-VMDIEBP\MSSQLSERVER06/sql_prac?driver=ODBC+Driver+17+for+SQL+Server
Done.

[('G1', 'India', 'APAC'),
 ('G2', 'USA', 'Americas'),
 ('G3', 'Canada', 'Americas'),
 ('G4', 'New Zealand', 'APAC'),
 ('G5', 'Australia', 'APAC'),
 ('G6', 'UK', 'Europe')]

In [45]:
df1 = %sql select * from geo where Geo = 'India'

 * mssql+pyodbc://veerareddy:***@DESKTOP-VMDIEBP\MSSQLSERVER06/sql_prac?driver=ODBC+Driver+17+for+SQL+Server
Done.

In [46]:
df1

[('G1', 'India', 'APAC')]

In [7]:
pd.read_sql("geo",connection)

  GeoID          Geo    Region
0    G1        India      APAC
1    G2          USA  Americas
2    G3       Canada  Americas
3    G4  New Zealand      APAC
4    G5    Australia      APAC
5    G6           UK    Europe

In [8]:
pd.read_sql("select * from geo",connection)

  GeoID          Geo    Region
0    G1        India      APAC
1    G2          USA  Americas
2    G3       Canada  Americas
3    G4  New Zealand      APAC
4    G5    Australia      APAC
5    G6           UK    Europe

In [9]:
pd.read_sql_query("select * from geo",connection)

  GeoID          Geo    Region
0    G1        India      APAC
1    G2          USA  Americas
2    G3       Canada  Americas
3    G4  New Zealand      APAC
4    G5    Australia      APAC
5    G6           UK    Europe

In [10]:
pd.read_sql_table("people_delish",connection)

       Salesperson  SPID    Team    Location
0   Wilone O'Kielt  SP04  Delish   Hyderabad
1     Gigi Bohling  SP05  Delish   Hyderabad
2   Curtice Advani  SP06  Delish   Hyderabad
3      Kaine Padly  SP07  Delish   Hyderabad
4     Jan Morforth  SP13  Delish  Wellington
5   Dotty Strutley  SP14  Delish  Wellington
6  Roddy Speechley  SP24  Delish     Seattle
7   Camilla Castle  SP25  Delish     Seattle
8  Janene Hairsine  SP26  Delish       Paris
9      Gray Seamon  SP31  Delish       Paris

In [12]:
df = pd.read_sql("select * from geo where Geo = 'USA'",connection)

In [13]:
df

  GeoID  Geo    Region
0    G2  USA  Americas

In [14]:
df.to_sql("geo_USA",connection,if_exists='replace',index=False)

1

In [15]:
connection.commit()

In [16]:
connection.close()